Revit 2027 API
DocumentDifference.GetDeletedElementIds Method
 Deleted element id collection. For non-worksharing models, this will always be an empty collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetDeletedElementIds()
Public Function GetDeletedElementIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetDeletedElementIds()
member GetDeletedElementIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
See Also
Reference
DocumentDifference Class
Autodesk.Revit.DB Namespace